Repository: izyuumi/yorozu
Catalog: apps/mac/Resources/Localizable.xcstrings
Source language: en
Languages: es, ja, ko, zh_hans

source: Confirming delivery…
es: Confirmando la entrega…
ja: 配信を確認中…
ko: 전달 확인 중…
zh_hans: 正在确认送达…

source: Delivery unconfirmed
es: Entrega sin confirmar
ja: 配信を確認できません
ko: 전달 확인 안 됨
zh_hans: 送达未确认

source: Delivery unconfirmed — click to retry
es: Entrega sin confirmar — haz clic para reintentar
ja: 配信を確認できません — クリックして再試行
ko: 전달 확인 안 됨 — 클릭하여 다시 시도
zh_hans: 送达未确认 — 点击重试

source: The most specific matching rule applies. If equally specific rules conflict, Never allow wins.
es: Se aplica la regla coincidente más específica. Si entran en conflicto reglas igual de específicas, prevalece «No permitir nunca».
ja: 一致するルールのうち、最も具体的なものが適用されます。同じ具体性のルールが競合する場合は、「許可しない」が優先されます。
ko: 일치하는 규칙 중 가장 구체적인 규칙이 적용됩니다. 구체성이 같은 규칙이 충돌하면 '허용 안 함'이 우선합니다.
zh_hans: 应用最具体的匹配规则。如果同样具体的规则发生冲突，则“永不允许”优先。

source: Archived
es: Archivados
ja: アーカイブ済み
ko: 보관됨
zh_hans: 已归档

source: Online now
es: En línea ahora
ja: 現在オンライン
ko: 현재 온라인
zh_hans: 当前在线

source: Paired
es: Emparejado
ja: ペアリング済み
ko: 페어링됨
zh_hans: 已配对

source: Last seen %@
es: Última conexión: %@
ja: 最終接続：%@
ko: 마지막 연결: %@
zh_hans: 上次在线：%@

source: Choose photos or files for this message
es: Elige fotos o archivos para este mensaje
ja: このメッセージに添付する写真やファイルを選びます
ko: 이 메시지에 첨부할 사진이나 파일을 선택하세요
zh_hans: 为此消息选择照片或文件

source: Some attachments couldn’t be added. A message can contain up to 10 attachments and 20 MB in total.
es: No se pudieron añadir algunos archivos adjuntos. Un mensaje puede contener hasta 10 archivos adjuntos y un total de 20 MB.
ja: 一部の添付ファイルを追加できませんでした。1つのメッセージに添付できるファイルは10個まで、合計20 MBまでです。
ko: 일부 첨부 파일을 추가할 수 없습니다. 메시지 하나에 파일을 최대 10개, 총 20 MB까지 첨부할 수 있습니다.
zh_hans: 部分附件无法添加。每条消息最多可包含 10 个附件，总大小不得超过 20 MB。

source: Refresh folders
es: Actualizar carpetas
ja: フォルダを更新
ko: 폴더 새로 고침
zh_hans: 刷新文件夹

source: Folders come from the host Mac’s projects directory (~/Projects by default). Add a project folder there, then refresh.
es: Las carpetas provienen del directorio de proyectos del Mac anfitrión (~/Projects por defecto). Añade allí una carpeta de proyecto y actualiza.
ja: ホストMacのプロジェクトディレクトリ（デフォルトは ~/Projects）にあるフォルダを表示します。そこにプロジェクトフォルダを追加してから、更新してください。
ko: 호스트 Mac의 프로젝트 디렉터리(기본값: ~/Projects)에 있는 폴더를 표시합니다. 그곳에 프로젝트 폴더를 추가한 후 새로 고침하세요.
zh_hans: 文件夹来自主机 Mac 的项目目录（默认为 ~/Projects）。请在那里添加项目文件夹，然后刷新。

source: Add a project folder on the host Mac to get started.
es: Añade una carpeta de proyecto en el Mac anfitrión para empezar.
ja: ホストMacにプロジェクトフォルダを追加して始めましょう。
ko: 시작하려면 호스트 Mac에 프로젝트 폴더를 추가하세요.
zh_hans: 请先在主机 Mac 上添加项目文件夹。

source: Loading project folders…
es: Cargando carpetas de proyectos…
ja: プロジェクトフォルダを読み込み中…
ko: 프로젝트 폴더 불러오는 중…
zh_hans: 正在加载项目文件夹…

source: Host Mac unavailable
es: Mac anfitrión no disponible
ja: ホストMacに接続できません
ko: 호스트 Mac을 사용할 수 없음
zh_hans: 主机 Mac 不可用

source: Connect to your host Mac to load its project folders.
es: Conéctate al Mac anfitrión para cargar sus carpetas de proyectos.
ja: ホストMacに接続して、プロジェクトフォルダを読み込んでください。
ko: 프로젝트 폴더를 불러오려면 호스트 Mac에 연결하세요.
zh_hans: 请连接主机 Mac 以加载其项目文件夹。

source: Couldn’t load project folders
es: No se pudieron cargar las carpetas de proyectos
ja: プロジェクトフォルダを読み込めませんでした
ko: 프로젝트 폴더를 불러올 수 없습니다
zh_hans: 无法加载项目文件夹

source: Check that Yorozu is running on the host Mac, then refresh.
es: Comprueba que Yorozu esté abierto en el Mac anfitrión y actualiza.
ja: ホストMacでYorozuが起動していることを確認してから、更新してください。
ko: 호스트 Mac에서 Yorozu가 실행 중인지 확인한 후 새로 고침하세요.
zh_hans: 请确认主机 Mac 上的 Yorozu 正在运行，然后刷新。

source: Host Mac unavailable. Showing previously loaded folders.
es: Mac anfitrión no disponible. Se muestran las carpetas cargadas anteriormente.
ja: ホストMacに接続できません。前回読み込んだフォルダを表示しています。
ko: 호스트 Mac을 사용할 수 없습니다. 이전에 불러온 폴더를 표시합니다.
zh_hans: 主机 Mac 不可用。正在显示之前加载的文件夹。

source: Couldn’t refresh. Showing previously loaded folders.
es: No se pudo actualizar. Se muestran las carpetas cargadas anteriormente.
ja: 更新できませんでした。前回読み込んだフォルダを表示しています。
ko: 새로 고칠 수 없습니다. 이전에 불러온 폴더를 표시합니다.
zh_hans: 无法刷新。正在显示之前加载的文件夹。

source: Starts a thread in this folder on the host Mac
es: Inicia una conversación en esta carpeta del Mac anfitrión
ja: ホストMacのこのフォルダで会話を開始します
ko: 호스트 Mac의 이 폴더에서 대화를 시작합니다
zh_hans: 在主机 Mac 的此文件夹中开始对话

source: Message %@
es: Enviar un mensaje a %@
ja: %@にメッセージを送信
ko: %@에게 메시지 보내기
zh_hans: 向 %@ 发送消息

source: Start with %@
es: Empieza con %@
ja: %@で始める
ko: %@로 시작하기
zh_hans: 开始使用 %@

source: Describe a change, ask about the code, or investigate a problem in this project.
es: Describe un cambio, pregunta sobre el código o investiga un problema en este proyecto.
ja: このプロジェクトで行いたい変更を説明したり、コードについて質問したり、問題を調べたりできます。
ko: 이 프로젝트에서 변경할 내용을 설명하거나, 코드에 대해 질문하거나, 문제를 조사하세요.
zh_hans: 描述更改、询问代码，或调查此项目中的问题。

source: Start a new thread and choose a project folder for this coding agent.
es: Inicia una nueva conversación y elige una carpeta de proyecto para este agente de programación.
ja: 新しい会話を開始し、このコーディングエージェントのプロジェクトフォルダを選んでください。
ko: 새 대화를 시작하고 이 코딩 에이전트가 사용할 프로젝트 폴더를 선택하세요.
zh_hans: 请开始新对话，并为此编程智能体选择项目文件夹。

source: Project folder: %@
es: Carpeta del proyecto: %@
ja: プロジェクトフォルダ：%@
ko: 프로젝트 폴더: %@
zh_hans: 项目文件夹：%@

source: Mac online
es: Mac conectado
ja: Macはオンラインです
ko: Mac 온라인
zh_hans: Mac 在线

source: Loading attachments…
es: Cargando archivos adjuntos…
ja: 添付ファイルを読み込み中…
ko: 첨부 파일 불러오는 중…
zh_hans: 正在加载附件…

source: Couldn’t load attachments
es: No se pudieron cargar los archivos adjuntos
ja: 添付ファイルを読み込めませんでした
ko: 첨부 파일을 불러올 수 없습니다
zh_hans: 无法加载附件

source: Attachments couldn’t be added
es: No se pudieron añadir los archivos adjuntos
ja: 添付ファイルを追加できませんでした
ko: 첨부 파일을 추가할 수 없습니다
zh_hans: 无法添加附件

source: Retry failed attachments
es: Reintentar los archivos adjuntos fallidos
ja: 失敗した添付ファイルを再試行
ko: 실패한 첨부 파일 다시 시도
zh_hans: 重试失败的附件

source: Loading attachments
es: Cargando archivos adjuntos
ja: 添付ファイルを読み込み中
ko: 첨부 파일 불러오는 중
zh_hans: 正在加载附件

source: Remove an attachment to add another
es: Elimina un archivo adjunto para añadir otro
ja: 別のファイルを追加するには、添付ファイルを1つ取り除いてください
ko: 다른 파일을 추가하려면 첨부 파일 하나를 제거하세요
zh_hans: 请移除一个附件后再添加其他附件

source: Each attachment must be 5 MB or smaller.
es: Cada archivo adjunto debe ocupar 5 MB o menos.
ja: 各添付ファイルは5 MB以下にしてください。
ko: 첨부 파일은 각각 5 MB 이하여야 합니다.
zh_hans: 每个附件不得超过 5 MB。

source: Couldn’t read the image. Copy it again or choose another file.
es: No se pudo leer la imagen. Cópiala de nuevo o elige otro archivo.
ja: 画像を読み取れませんでした。もう一度コピーするか、別のファイルを選んでください。
ko: 이미지를 읽을 수 없습니다. 다시 복사하거나 다른 파일을 선택하세요.
zh_hans: 无法读取图片。请重新复制或选择其他文件。

source: Couldn’t open the selected files. Choose them again and check that they’re available on this device.
es: No se pudieron abrir los archivos seleccionados. Selecciónalos de nuevo y comprueba que estén disponibles en este dispositivo.
ja: 選択したファイルを開けませんでした。もう一度選択し、このデバイスで利用できることを確認してください。
ko: 선택한 파일을 열 수 없습니다. 다시 선택하고 이 기기에서 사용할 수 있는지 확인하세요.
zh_hans: 无法打开所选文件。请重新选择，并确认此设备可以访问这些文件。

source: Couldn’t read the photo. Try taking it again.
es: No se pudo leer la foto. Intenta tomarla de nuevo.
ja: 写真を読み取れませんでした。もう一度撮影してください。
ko: 사진을 읽을 수 없습니다. 다시 촬영해 보세요.
zh_hans: 无法读取照片。请重新拍摄。

source: Couldn’t load: %@. Try again, or choose another file.
es: No se pudo cargar: %@. Inténtalo de nuevo o elige otro archivo.
ja: 読み込めませんでした：%@。もう一度試すか、別のファイルを選んでください。
ko: 불러올 수 없습니다: %@. 다시 시도하거나 다른 파일을 선택하세요.
zh_hans: 无法加载：%@。请重试或选择其他文件。

source: Couldn’t load the attachments. Choose them again.
es: No se pudieron cargar los archivos adjuntos. Selecciónalos de nuevo.
ja: 添付ファイルを読み込めませんでした。もう一度選択してください。
ko: 첨부 파일을 불러올 수 없습니다. 다시 선택하세요.
zh_hans: 无法加载附件。请重新选择。

source: Couldn’t read: %@. Choose another file.
es: No se pudo leer: %@. Elige otro archivo.
ja: 読み取れませんでした：%@。別のファイルを選んでください。
ko: 읽을 수 없습니다: %@. 다른 파일을 선택하세요.
zh_hans: 无法读取：%@。请选择其他文件。

source: Too large: %@. Each attachment must be 5 MB or smaller.
es: Demasiado grande: %@. Cada archivo adjunto debe ocupar 5 MB o menos.
ja: サイズが大きすぎます：%@。各添付ファイルは5 MB以下にしてください。
ko: 파일이 너무 큽니다: %@. 첨부 파일은 각각 5 MB 이하여야 합니다.
zh_hans: 文件过大：%@。每个附件不得超过 5 MB。

source: A message can contain up to 10 attachments. Remove one to add another.
es: Un mensaje puede contener hasta 10 archivos adjuntos. Elimina uno para añadir otro.
ja: 1つのメッセージに添付できるファイルは10個までです。別のファイルを追加するには、1つ取り除いてください。
ko: 메시지 하나에 파일을 최대 10개까지 첨부할 수 있습니다. 다른 파일을 추가하려면 하나를 제거하세요.
zh_hans: 每条消息最多可包含 10 个附件。请移除一个后再添加其他附件。

source: Send answer
es: Enviar respuesta
ja: 回答を送信
ko: 답변 보내기
zh_hans: 发送回答

source: Enter a value for %@, or switch it to Any.
es: Introduce un valor para %@ o cambia a Cualquiera.
ja: %@の値を入力するか、「任意」に切り替えてください。
ko: %@의 값을 입력하거나 모두로 전환하세요.
zh_hans: 请输入 %@ 的值，或切换为“任意”。

source: Choose at least one scope field before saving.
es: Elige al menos un campo de alcance antes de guardar.
ja: 保存する前に、適用範囲の項目を1つ以上選んでください。
ko: 저장하기 전에 적용 범위 필드를 하나 이상 선택하세요.
zh_hans: 保存前请至少选择一个适用范围字段。

source: Enter a valid amount of zero or more.
es: Introduce un importe válido igual o superior a cero.
ja: 0以上の有効な金額を入力してください。
ko: 0 이상의 올바른 금액을 입력하세요.
zh_hans: 请输入有效的非负金额。

source: Wait for attachments to finish loading, then paste again.
es: Espera a que terminen de cargarse los archivos adjuntos e intenta pegar de nuevo.
ja: 添付ファイルの読み込みが完了してから、もう一度貼り付けてください。
ko: 첨부 파일을 모두 불러온 후 다시 붙여 넣으세요.
zh_hans: 请等待附件加载完成，然后重新粘贴。

source: Not granted
es: Sin conceder
ja: 未許可
ko: 허용되지 않음
zh_hans: 未授权

source: Paired device
es: Dispositivo emparejado
ja: ペアリング済みデバイス
ko: 페어링된 기기
zh_hans: 已配对设备

source: Device ID: %@
es: ID del dispositivo: %@
ja: デバイスID：%@
ko: 기기 ID: %@
zh_hans: 设备 ID：%@

source: Remove device %@
es: Eliminar dispositivo %@
ja: デバイス%@を削除
ko: 기기 %@ 제거
zh_hans: 移除设备 %@

source: Remove paired device %@? Device ID: %@ This device will lose access to this Mac and must pair again to reconnect.
es: ¿Eliminar el dispositivo emparejado %@? ID del dispositivo: %@ Este dispositivo perderá el acceso a este Mac y deberá emparejarse de nuevo para reconectarse.
ja: ペアリング済みデバイス%@を削除しますか？ デバイスID：%@ このデバイスはこのMacにアクセスできなくなります。再接続するには、もう一度ペアリングする必要があります。
ko: 페어링된 기기 %@을(를) 제거하시겠습니까? 기기 ID: %@ 이 기기는 이 Mac에 접근할 수 없게 됩니다. 다시 연결하려면 새로 페어링해야 합니다.
zh_hans: 要移除已配对设备 %@ 吗？设备 ID：%@ 此设备将无法再访问这台 Mac，需要重新配对才能连接。

source: No devices yet. Pair an iPhone, iPad, or another Mac to chat with this Mac.
es: Todavía no hay dispositivos. Empareja un iPhone, iPad u otro Mac para conversar con este Mac.
ja: デバイスはまだありません。iPhone、iPad、または別のMacをペアリングすると、このMacとチャットできます。
ko: 아직 기기가 없습니다. 이 Mac과 대화하려면 iPhone, iPad 또는 다른 Mac을 페어링하세요.
zh_hans: 尚无设备。请配对 iPhone、iPad 或另一台 Mac，即可与这台 Mac 对话。

source: Couldn’t load paired devices
es: No se pudieron cargar los dispositivos emparejados
ja: ペアリング済みデバイスを読み込めませんでした
ko: 페어링된 기기를 불러올 수 없습니다
zh_hans: 无法加载已配对设备

source: Check the connection in General settings, then try again.
es: Comprueba la conexión en los ajustes generales e inténtalo de nuevo.
ja: 「一般」設定で接続を確認してから、もう一度お試しください。
ko: 일반 설정에서 연결을 확인한 후 다시 시도하세요.
zh_hans: 请在“通用”设置中检查连接，然后重试。

source: Try again
es: Intentar de nuevo
ja: もう一度試す
ko: 다시 시도
zh_hans: 重试

source: Checking paired devices…
es: Comprobando dispositivos emparejados…
ja: ペアリング済みデバイスを確認中…
ko: 페어링된 기기 확인 중…
zh_hans: 正在检查已配对设备…

source: Scan with Yorozu on your iPhone or iPad.
es: Escanea con Yorozu en tu iPhone o iPad.
ja: iPhoneまたはiPadのYorozuでスキャンしてください。
ko: iPhone 또는 iPad의 Yorozu로 스캔하세요.
zh_hans: 请使用 iPhone 或 iPad 上的 Yorozu 扫描。

source: Pairing is temporarily unavailable
es: El emparejamiento no está disponible temporalmente
ja: ペアリングを一時的に利用できません
ko: 일시적으로 페어링할 수 없습니다
zh_hans: 暂时无法配对

source: Check the connection in General settings. When Yorozu reconnects, request a new code.
es: Comprueba la conexión en los ajustes generales. Cuando Yorozu se reconecte, solicita un código nuevo.
ja: 「一般」設定で接続を確認してください。Yorozuが再接続したら、新しいコードを発行してください。
ko: 일반 설정에서 연결을 확인하세요. Yorozu가 다시 연결되면 새 코드를 요청하세요.
zh_hans: 请在“通用”设置中检查连接。Yorozu 重新连接后，请请求新的配对码。

source: Preparing a pairing code…
es: Preparando un código de emparejamiento…
ja: ペアリングコードを準備中…
ko: 페어링 코드 준비 중…
zh_hans: 正在准备配对码…

source: Use the pairing code below to connect your device.
es: Usa el código de emparejamiento de abajo para conectar tu dispositivo.
ja: 下のペアリングコードを使ってデバイスを接続してください。
ko: 아래 페어링 코드로 기기를 연결하세요.
zh_hans: 请使用下方配对码连接设备。

source: Or paste this code into Yorozu on your iPhone, iPad, or another Mac.
es: O pega este código en Yorozu en tu iPhone, iPad u otro Mac.
ja: または、このコードをiPhone、iPad、または別のMacのYorozuに貼り付けてください。
ko: 또는 이 코드를 iPhone, iPad 또는 다른 Mac의 Yorozu에 붙여 넣으세요.
zh_hans: 或将此代码粘贴到 iPhone、iPad 或另一台 Mac 上的 Yorozu 中。

source: Show full action
es: Mostrar la acción completa
ja: 操作の全文を表示
ko: 작업 전체 보기
zh_hans: 显示完整操作

source: Show full content
es: Mostrar el contenido completo
ja: 内容の全文を表示
ko: 내용 전체 보기
zh_hans: 显示完整内容

source: Show less
es: Mostrar menos
ja: 折りたたむ
ko: 접기
zh_hans: 收起

source: Show less action
es: Contraer la acción
ja: 操作を折りたたむ
ko: 작업 접기
zh_hans: 收起操作

source: Show less content
es: Contraer el contenido
ja: 内容を折りたたむ
ko: 내용 접기
zh_hans: 收起内容

source: Expanded
es: Expandido
ja: 展開済み
ko: 펼쳐짐
zh_hans: 已展开

source: Collapsed
es: Contraído
ja: 折りたたみ済み
ko: 접힘
zh_hans: 已收起

source: Currency
es: Moneda
ja: 通貨
ko: 통화
zh_hans: 币种

source: Unspecified
es: Sin especificar
ja: 未指定
ko: 지정되지 않음
zh_hans: 未指定

source: Anything over the cap is asked about as usual. The cap uses the transaction’s currency.
es: Como siempre, se pedirá aprobación si se supera el límite. El límite usa la moneda de la transacción.
ja: 上限を超える場合は、通常どおり承認を求めます。上限には取引の通貨を使用します。
ko: 한도를 초과하면 평소처럼 승인을 요청합니다. 한도는 거래 통화를 기준으로 합니다.
zh_hans: 超出上限时仍会照常请求批准。上限使用交易的币种。

source: %@ (currency unspecified)
es: %@ (moneda sin especificar)
ja: %@（通貨未指定）
ko: %@ (통화 미지정)
zh_hans: %@（币种未指定）

source: Waiting for your approval
es: Esperando tu aprobación
ja: 承認を待っています
ko: 승인을 기다리는 중
zh_hans: 等待你批准

source: Waiting for your answer
es: Esperando tu respuesta
ja: 回答を待っています
ko: 답변을 기다리는 중
zh_hans: 等待你回答

source: Skip approvals for all agents
es: Omitir aprobaciones para todos los agentes
ja: すべてのエージェントの承認を省略
ko: 모든 에이전트의 승인 건너뛰기
zh_hans: 跳过所有智能体的批准请求

source: Applies to all agents and conversations on the host Mac and its paired devices. Tool requests can run without asking, including purchases, messages, commands, and deletes.
es: Se aplica a todos los agentes y conversaciones del Mac anfitrión y sus dispositivos emparejados. Las solicitudes de herramientas pueden ejecutarse sin pedir aprobación, incluidas compras, mensajes, comandos y eliminaciones.
ja: ホストMac、およびそのMacにペアリング済みのデバイス上のすべてのエージェントと会話に適用されます。購入、メッセージ送信、コマンド実行、削除などのツール操作が、承認を求めずに実行されることがあります。
ko: 호스트 Mac 및 해당 Mac에 페어링된 기기의 모든 에이전트와 대화에 적용됩니다. 구매, 메시지 전송, 명령 실행, 삭제를 포함한 도구 요청이 승인 없이 실행될 수 있습니다.
zh_hans: 适用于主机 Mac 及其已配对设备上的所有智能体和对话。工具请求可以不经批准就执行，包括购买、发送消息、运行命令和删除操作。

source: Current model: %@
es: Modelo actual: %@
ja: 現在のモデル：%@
ko: 현재 모델: %@
zh_hans: 当前模型：%@

source: Effort: %@
es: Esfuerzo: %@
ja: 思考量：%@
ko: 추론 강도: %@
zh_hans: 推理强度：%@

source: Host Mac offline
es: Mac anfitrión sin conexión
ja: ホストMacはオフラインです
ko: 호스트 Mac이 오프라인 상태임
zh_hans: 主机 Mac 已离线

source: Offline
es: Sin conexión
ja: オフライン
ko: 오프라인
zh_hans: 离线

source: Couldn’t connect
es: No se pudo conectar
ja: 接続できませんでした
ko: 연결할 수 없습니다
zh_hans: 无法连接

source: Check your network and that Yorozu is open on your host Mac. Yorozu will keep trying to reconnect.
es: Comprueba tu conexión de red y que Yorozu esté abierto en el Mac anfitrión. Yorozu seguirá intentando reconectarse.
ja: ネットワーク接続と、ホストMacでYorozuが起動していることを確認してください。Yorozuは再接続を試み続けます。
ko: 네트워크 연결을 확인하고 호스트 Mac에서 Yorozu가 실행 중인지 확인하세요. Yorozu가 계속 재연결을 시도합니다.
zh_hans: 请检查网络连接，并确认主机 Mac 上已打开 Yorozu。Yorozu 会继续尝试重新连接。

source: Open Yorozu on your host Mac. Your conversations will reconnect when it is available.
es: Abre Yorozu en el Mac anfitrión. Tus conversaciones se reconectarán cuando esté disponible.
ja: ホストMacでYorozuを開いてください。接続できるようになると、会話は再接続されます。
ko: 호스트 Mac에서 Yorozu를 여세요. 연결이 가능해지면 대화가 다시 연결됩니다.
zh_hans: 请在主机 Mac 上打开 Yorozu。主机可用时，对话会重新连接。

source: Connecting to your host Mac
es: Conectando con tu Mac anfitrión
ja: ホストMacに接続中
ko: 호스트 Mac에 연결 중
zh_hans: 正在连接主机 Mac

source: Retry connection
es: Reintentar conexión
ja: 接続を再試行
ko: 연결 다시 시도
zh_hans: 重试连接

source: Retrying keeps your pairing and conversations.
es: Al reintentar se conservan el emparejamiento y las conversaciones.
ja: 再試行しても、ペアリングと会話は保持されます。
ko: 다시 시도해도 페어링과 대화는 유지됩니다.
zh_hans: 重试会保留配对和对话。

source: Couldn’t connect. Generate a new pairing code and try again.
es: No se pudo conectar. Genera un nuevo código de emparejamiento e inténtalo de nuevo.
ja: 接続できませんでした。新しいペアリングコードを生成して、もう一度お試しください。
ko: 연결할 수 없습니다. 새 페어링 코드를 생성한 후 다시 시도하세요.
zh_hans: 无法连接。请生成新的配对码，然后重试。

source: How will this Mac use Yorozu?
es: ¿Cómo usará Yorozu este Mac?
ja: このMacでYorozuをどのように使いますか？
ko: 이 Mac에서 Yorozu를 어떻게 사용하시겠어요?
zh_hans: 这台 Mac 将如何使用 Yorozu？

source: You can change this later in Settings.
es: Puedes cambiarlo más tarde en Ajustes.
ja: 後で設定から変更できます。
ko: 나중에 설정에서 변경할 수 있습니다.
zh_hans: 稍后可在“设置”中更改。

source: Host Yorozu on this Mac
es: Alojar Yorozu en este Mac
ja: このMacでYorozuをホスト
ko: 이 Mac에서 Yorozu 호스트
zh_hans: 在这台 Mac 上托管 Yorozu

source: Run OpenClaw here and let your iPhone or other Macs connect.
es: Ejecuta OpenClaw aquí y conecta tu iPhone u otros Mac.
ja: ここでOpenClawを実行し、iPhoneやほかのMacから接続します。
ko: 여기서 OpenClaw를 실행하고 iPhone이나 다른 Mac을 연결하세요.
zh_hans: 在这里运行 OpenClaw，并让 iPhone 或其他 Mac 连接。

source: Use Yorozu here while your host Mac does the work.
es: Usa Yorozu aquí mientras el Mac anfitrión hace el trabajo.
ja: ホストMacで処理しながら、このMacでYorozuを使います。
ko: 호스트 Mac에서 처리하고 이 Mac에서는 Yorozu를 사용하세요.
zh_hans: 由主机 Mac 执行任务，在这台 Mac 上使用 Yorozu。

source: Connect your devices
es: Conecta tus dispositivos
ja: デバイスを接続
ko: 기기 연결
zh_hans: 连接设备

source: Scan this code from Yorozu on an iPhone or client Mac.
es: Escanea este código desde Yorozu en un iPhone o Mac cliente.
ja: iPhoneまたはクライアントMacのYorozuでこのコードをスキャンします。
ko: iPhone 또는 클라이언트 Mac의 Yorozu에서 이 코드를 스캔하세요.
zh_hans: 使用 iPhone 或客户端 Mac 上的 Yorozu 扫描此代码。

source: Skip for now
es: Omitir por ahora
ja: 今はスキップ
ko: 나중에 하기
zh_hans: 暂时跳过

source: Connect to your host Mac
es: Conecta con tu Mac anfitrión
ja: ホストMacに接続
ko: 호스트 Mac에 연결
zh_hans: 连接到主机 Mac

source: On the host Mac, open Settings › Devices › Pair Another Device, then paste its code here.
es: En el Mac anfitrión, abre Ajustes › Dispositivos › Emparejar otro dispositivo y pega aquí el código.
ja: ホストMacで「設定」›「デバイス」›「別のデバイスをペアリング」を開き、コードをここに貼り付けます。
ko: 호스트 Mac에서 설정 › 기기 › 다른 기기 페어링을 열고 코드를 여기에 붙여 넣으세요.
zh_hans: 在主机 Mac 上打开“设置”›“设备”›“配对其他设备”，然后将代码粘贴到这里。

source: That pairing code is invalid or expired.
es: El código de emparejamiento no es válido o ha caducado.
ja: ペアリングコードが無効か、有効期限が切れています。
ko: 페어링 코드가 잘못되었거나 만료되었습니다.
zh_hans: 该配对码无效或已过期。

source: Choose what Yorozu can do
es: Elige qué puede hacer Yorozu
ja: Yorozuでできることを選ぶ
ko: Yorozu가 할 수 있는 작업 선택
zh_hans: 选择 Yorozu 可以执行的操作

source: Optional. Grant only capabilities you want; you can return anytime.
es: Opcional. Concede solo las funciones que quieras; puedes volver cuando quieras.
ja: 任意です。必要な機能だけを許可してください。いつでも変更できます。
ko: 선택 사항입니다. 원하는 기능만 허용하세요. 언제든 다시 설정할 수 있습니다.
zh_hans: 可选。只授予你需要的功能；随时可以回来更改。

source: This Mac is ready to use Yorozu through your host Mac.
es: Este Mac ya puede usar Yorozu a través del Mac anfitrión.
ja: このMacでホストMac経由のYorozuを使う準備ができました。
ko: 이 Mac에서 호스트 Mac을 통해 Yorozu를 사용할 준비가 되었습니다.
zh_hans: 这台 Mac 已可通过主机 Mac 使用 Yorozu。

source: Your device is connected and ready to use.
es: Tu dispositivo está conectado y listo para usar.
ja: デバイスが接続され、使用できるようになりました。
ko: 기기가 연결되어 사용할 준비가 되었습니다.
zh_hans: 设备已连接，可以使用。

source: This Mac
es: Este Mac
ja: このMac
ko: 이 Mac
zh_hans: 此 Mac

source: Role
es: Función
ja: 役割
ko: 역할
zh_hans: 角色

source: Host Yorozu here
es: Alojar Yorozu aquí
ja: このMacでYorozuをホスト
ko: 이 Mac에서 Yorozu 호스팅
zh_hans: 在此 Mac 上托管 Yorozu

source: Connect to another Mac
es: Conectar a otro Mac
ja: 別のMacに接続
ko: 다른 Mac에 연결
zh_hans: 连接到另一台 Mac

source: Paste pairing code
es: Pegar código de enlace
ja: ペアリングコードを貼り付け
ko: 페어링 코드 붙여넣기
zh_hans: 粘贴配对代码

source: Connect
es: Conectar
ja: 接続
ko: 연결
zh_hans: 连接

source: Connection
es: Conexión
ja: 接続
ko: 연결
zh_hans: 连接

source: Connecting…
es: Conectando…
ja: 接続中…
ko: 연결 중…
zh_hans: 正在连接…

source: Paired since
es: Enlazado desde
ja: ペアリング日時
ko: 페어링 날짜
zh_hans: 配对时间

source: Unpair
es: Desenlazar
ja: ペアリング解除
ko: 페어링 해제
zh_hans: 取消配对

source: Unpair this Mac?
es: ¿Desenlazar este Mac?
ja: このMacのペアリングを解除しますか？
ko: 이 Mac의 페어링을 해제할까요?
zh_hans: 要取消此 Mac 的配对吗？

source: Yorozu will remove pairing keys and all cached chats from this Mac.
es: Yorozu eliminará las claves de enlace y todos los chats almacenados en caché de este Mac.
ja: YorozuはこのMacからペアリングキーとキャッシュされたすべてのチャットを削除します。
ko: Yorozu가 이 Mac에서 페어링 키와 캐시된 모든 채팅을 삭제합니다.
zh_hans: Yorozu 将从此 Mac 移除配对密钥和所有缓存聊天。

source: This Mac uses the OpenClaw runtime on its paired host Mac.
es: Este Mac usa el entorno OpenClaw del Mac anfitrión enlazado.
ja: このMacはペアリングしたホストMacのOpenClawランタイムを使用します。
ko: 이 Mac은 페어링된 호스트 Mac의 OpenClaw 런타임을 사용합니다.
zh_hans: 此 Mac 使用已配对主机 Mac 上的 OpenClaw 运行时。

source: API key
es: Clave de API
ja: APIキー
ko: API 키
zh_hans: API 密钥

source: Accessibility
es: Accesibilidad
ja: アクセシビリティ
ko: 손쉬운 사용
zh_hans: 辅助功能

source: Account
es: Cuenta
ja: アカウント
ko: 계정
zh_hans: 账户

source: Action
es: Acción
ja: アクション
ko: 작업
zh_hans: 操作

source: Add Provider
es: Añadir proveedor
ja: プロバイダーを追加
ko: 제공자 추가
zh_hans: 添加提供商

source: Add a note
es: Añadir una nota
ja: メモを追加
ko: 메모 추가
zh_hans: 添加备注

source: Adds this reaction
es: Añade esta reacción
ja: このリアクションを追加
ko: 이 반응 추가
zh_hans: 添加此回应

source: Agent runtime
es: Entorno de ejecución del agente
ja: エージェントランタイム
ko: 에이전트 런타임
zh_hans: Agent 运行时

source: Allow
es: Permitir
ja: 許可
ko: 허용
zh_hans: 允许

source: Allowed for this task
es: Permitido para esta tarea
ja: このタスクで許可
ko: 이 작업에 허용됨
zh_hans: 已为此任务允许

source: Allowed once
es: Permitido una vez
ja: 今回のみ許可
ko: 한 번 허용됨
zh_hans: 已允许一次

source: Allowed, and saved as a rule
es: Permitido y guardado como regla
ja: 許可し、ルールとして保存済み
ko: 허용되고 규칙으로 저장됨
zh_hans: 已允许并保存为规则

source: Always allow %arg…
es: Permitir siempre %arg…
ja: 常に %arg を許可…
ko: 항상 %arg 허용…
zh_hans: 始终允许 %arg……

source: Always allow…
es: Permitir siempre…
ja: 常に許可…
ko: 항상 허용…
zh_hans: 始终允许…

source: Always ask at or above
es: Preguntar siempre a partir de
ja: 常に確認する（しきい値以上）
ko: 다음 수준 이상일 때 항상 확인
zh_hans: 达到或超过此阈值时始终询问

source: Amount
es: Importe
ja: 金額
ko: 금액
zh_hans: 金额

source: Answered
es: Respondido
ja: 回答済み
ko: 응답함
zh_hans: 已回答

source: Answered on another device
es: Respondido en otro dispositivo
ja: 別のデバイスで回答済み
ko: 다른 기기에서 응답함
zh_hans: 已在另一台设备上回答

source: Any
es: Cualquiera
ja: 任意
ko: 모두
zh_hans: 任意

source: Any %arg
es: Cualquier %arg
ja: 任意の %arg
ko: 모든 %arg
zh_hans: 任意 %arg

source: Anything over the cap is asked about as usual.
es: Se preguntará como siempre si se supera el límite.
ja: 上限を超える場合は通常どおり確認します。
ko: 한도를 초과하면 평소처럼 확인합니다.
zh_hans: 超过上限时仍会照常询问。

source: Approval
es: Aprobación
ja: 承認
ko: 승인
zh_hans: 批准

source: Approval needed: %arg
es: Se requiere aprobación: %arg
ja: 承認が必要: %arg
ko: 승인 필요: %arg
zh_hans: 需要批准：%arg

source: Apps and personal data
es: Aplicaciones y datos personales
ja: アプリと個人データ
ko: 앱 및 개인 데이터
zh_hans: 应用与个人数据

source: Archive
es: Archivar
ja: アーカイブ
ko: 보관
zh_hans: 归档

source: Ask Yorozu to explain before deciding
es: Pedir a Yorozu que lo explique antes de decidir
ja: 決める前に Yorozu に説明を求める
ko: 결정하기 전에 Yorozu에게 설명 요청
zh_hans: 决定前请 Yorozu 说明

source: Ask your Mac to look something up, keep track of it, or do it for you.
es: Pide a tu Mac que busque, controle o haga algo por ti.
ja: Mac に調査、記録、作業を頼めます。
ko: Mac에 검색, 기록 또는 작업을 요청하세요.
zh_hans: 让 Mac 帮你查询、记录或完成任务。

source: Asking macOS…
es: Consultando a macOS…
ja: macOS に確認中…
ko: macOS에 확인 중…
zh_hans: 正在询问 macOS……

source: Attach or paste a photo or file
es: Adjuntar o pegar una foto o archivo
ja: 写真またはファイルを添付／ペースト
ko: 사진 또는 파일 첨부/붙여넣기
zh_hans: 附加或粘贴照片或文件

source: Attached image, %arg
es: Imagen adjunta, %arg
ja: 添付画像、%arg
ko: 첨부된 이미지, %arg
zh_hans: 已附加图像，%arg
